باںدر
گدھا
بیبون
رِچھ
رچھ
سور
مجھ
بلد
وچھے
بوتی
بِلی
بلی
چِپاںزی
چپاںزی
گاں
مگرمچھ
ہِرن
ہرن
کُتا
کتا
کھوتا
ہاتھی
مادا
فَین
فین
لوںبڑی
ڈڈو
جِراف
جراف
بکری
گوریلا
گریزلی
خرگوس
ہَیمسٹر
ہیمسٹر
مادا
ہیپوپوٹیمس
سِںگ
سںگ
گھوڑا
ہاینا
ہائینا
گِدڑ
گدڑ
جاگوار
کںگارو
بِلی
بلی
بھیڑ
لںگور
چیتے
شیر
کِرلی
کرلی
گھوڑی
نیولا
مچھر
چوہا
خچر
بلد
چیتا
سور
ٹٹو
دارو
کتورے
خرگوش
چوہا
گَیںڈا
گیںڈا
بھیڈ
سپ
گھُںمنا
گھںمنا
گالڑ
باراںسِںگا
باراںسںگا
پوچھ
باگھ
کچھوا
کچھو
نیج
بگھِاڑ
بگھاڑ
زَیبرا
زیبرا
زوریلا
چمگِدڑ
چمگادڑ
کوڑا
مُرغے
مرغے
کوکاٹو
سارس
کاں
کوئل
کویل
جوان
گھُگی
گھگی
نر
بتخ
بطخ
کھِلواڑ
کھلواڑ
اِل
ال
کھںبھ
ہںس
باج
باز
مُرغی
مرغی
ہرن
کِںگفیشر
کںگفیشر
اِل
ال
لارک
مکا
گٹار
بُلبُل
بلبل
شُترمُرگ
شترمرگ
اُلو
الو
توتا
طوطا
تِتر
تتر
مور
پین
کبوتر
بٹیرا
کاں
ہِلا
ہلا
ٹٹیہری
چِڑی
چڑی
ہںس
چیل
کٹھفوڑا
اکَیڈمی
اکیڈمی
کاروائی
اداکار
ابھِنیتری
ابھنیتری
ہَیرانیجنک
ہیرانیجنک
گُسے
گسے
پِچھوکڑ
پچھوکڑ
کاسٹ
شرینی
چرِتر
چرتر
سِنیما
سنیما
اپرادھ
تباہی
دستاویزی
ناٹک
منورںجن
پرِوار
پروار
کلپنا
فِلم
فلم
مزاقیا
وِدھا
ودھا
ڈر
بناؤنا
فوجی
گتی
سںگیت
بھیت
چِترکاری
چترکاری
لوک
تصویر
بہُت
بہت
پلاٹ
نِرماتا
نرماتا
پروجَیکٹ
پروجیکٹ
منووِگیانک
منووگیانک
سمیکھِا
سمیکھا
روماںس
درِش
درش
سکرین
سکرینپلے
پٹکتھا
دکھاؤ
دھُنی
دھنی
تارا
کہانی
شَیلی
شیلی
ہَیرانی
ہیرانی
بھیانک
روماںچک
ٹریلر
ہِںسک
ہںسک
پچھمی
جو
مکی
باجرے
اوٹ
چول
جوٹھا
رائ
رای
کنک
جھونا
اناج
مَیڈا
میڈا
بِسکُٹ
بسکٹ
براں
روٹی
بروتھ
مکھن
پنیر
کافی
آٹا
چاپ
چُبارے
چبارے
بَیرک
بیرک
بار
باتھروم
غسلخانہ
لڑائی
لڑایی
شتیر
چھتیر
اِٹ
اٹ
عمارت
بںگلا
چھت
سیمںٹ
چرچ
کلیسر
کالج
ویہڑا
پڑا
گُںبد
گںبد
فَیکٹری
فیکٹری
فرش
قلعہ
کلہا
بُنیاد
فوارا
کلا
دانے
گٹر
چںد
ہسپتال
گھر
سراں
رسوئی
رسویی
پریوگشالا
لَیٹرین
لیٹرین
جالی
لائبریری
مسجِد
مسجد
دفتر
یتیمخانہ
مہل
پَیگ
پیگ
پلاسٹر
پلیٹفارم
پلِںتھ
پلںتھ
رَیفٹر
ریفٹر
ریلِںگ
ریلںگ
چھت
کمرا
وِدیالا
ودیالا
پوڑی
کھڑی
پتھر
مںدر
چھت
یونیورسِٹی
یونیورسٹی
پِشاب
پشاب
ہواداری
وراںڈا
برانڈا
چِڑیاگھر
چڑیاگھر
گِٹے
گٹے
باںہہ
کچھ
واپس
داہڑی
بیلی
لہو
شریر
ہڈی
دماغ
دماگ
چھاتی
وچھے
چیک
چھاتی
ٹھوڈی
کںن
کوہنی
اکھ
بھو
جھمکے
چِہرا
چہرا
اُںگلیاں
اںگلیاں
مُٹھی
مٹھی
پَیر
پیر
متھے
وال
ہتھ
مُکھی
مکھی
دِل
دل
اڈی
کمر
آںت
جبا
گُردے
گردے
گوڈے
لت
بُلہاں
جِگر
جگر
فیفڑ
مُچھ
مچھ
موہہ
منہ
پٹھے
میکھ
نابھی
گردن
نرو
نک
ناساں
موڈھا
چمڑی
کھوپڑی
ریڑھ
پیٹ
پٹ
گلا
اںگوٹھا
جیبھ
دںد
کلاایی
ساتھی
اگ
قاتل
حملہ
دھوکھا
وڈے
وچنبدھ
اپرادھ
اپرادھی
مںگ
ماروتھل
نسٹ
دستاویز
نسے
فرجی
مدد
گَیر-کانوںنی
گیر-کانوںنی
جانکاری
اگوا
مارنا
پَیسا
پیسا
بھُگتان
بھگتان
لوک
اِجاجت
اجاجت
سںپتی
جنتک
کارن
واپسی
ڈکَیتی
ڈکیتی
ویچو
تسکر
جاسوسی
اتوادی
چور
ہِںسا
ہںسا
ہِںسک
ہںسک
ہواباجی
کھیتی
سریر
اَینیمیسن
اینیمیسن
ارکیٹَیکچر
ارکیٹیکچر
اٹوموباایل
ہواباجی
بااِاوٹَیکنالوجی
باااوٹیکنالوجی
کاروبار
وسراوِک
وسراوک
کوریاوگ੍رافی
سِول
سول
سںچار
ڈِجااین
ڈجااین
ڈرااِںگ
ڈرااںگ
اِلَیکٹ੍ریکل
الیکٹ੍ریکل
اِلَیکٹ੍رونِکس
الیکٹ੍رونکس
فَیبرِکس
فیبرکس
بھو
گ੍رافِکس
گ੍رافکس
باگبانی
پ੍راہُنچاری
پ੍راہنچاری
سادھن
پترکاری
کانوںن
بھاساای
ملٹیمیڈیا
نرسِںگ
نرسںگ
پوسن
چِترکاری
چترکاری
ہتھیلی
پَیٹرولیام
پیٹرولیام
فارمیسی
درسن
فوٹوگ੍رافی
سریر
فِجیاوتھَیریپی
فجیاوتھیریپی
منووِگِان
منووگان
روبوٹِکس
روبوٹکس
مورتی
ٹَیکسٹاایل
ٹیکسٹاایل
اواجاای
بُناای
بناای
پہُںچ
پہںچ
سرگرمی
اَیپلیکیسن
ایپلیکیسن
برااوجر
بدل
کںپِاوٹر
کںپاوٹر
جُڑو
جڑو
کاپی
کھراب
بنااو
ڈاٹا
ڈِجااین
ڈجااین
ڈِجیٹل
ڈجیٹل
ڈااونلوڈ
چلااُنا
چلاانا
باہری
ہور
فاایل
ستھِر
ستھر
فںکسن
گرافِکس
گرافکس
اُچا
اچا
پچھان
مہتوپورن
جانکاری
اِںپُٹ
اںپٹ
اِںسٹال
اںسٹال
ہدااِت
ہداات
اںدرونی
اِںٹرنَیٹ
اںٹرنیٹ
ٹِکانا
ٹکانا
گُاچ
گاچ
ماپ
مَیموری
میموری
سںگیت
نَیٹورک
نیٹورک
گِنتی
گنتی
سںچالِت
سںچالت
اسلی
ااُٹپُٹ
ااٹپٹ
پںنے
ستھاای
اِجاجت
اجاجت
پرسِدھ
پ੍رسدھ
پ੍رکِرِا
پ੍رکرا
کارواای
پ੍روگرام
رِکارڈ
رکارڈ
سکرین
سُرکھِات
سرکھات
بھیجو
گتی
سٹور
مںنِا
مںنا
کںم
ٹَیکسٹ
ٹیکسٹ
تبادلا
اپڈیٹ
ویڈیاو
وااِرس
واارس
وِجٹر
وجٹر
وَیب
ویب
سبد
لال
سںتری
پیلا
ہرا
سیان
نیلا
جامنی
گُلابی
گلابی
سفَید
سفید
سلیٹی
بھورا
کالا
چمکدار
سلیٹی-چِٹا
سلیٹی-چٹا
ہلکا
چمکدار
ہلکا
سُنہِری
سنہری
فِکے
فکے
پیلا-بھورا
ہرا-نیلا
بَیلٹ
بیلٹ
کںبل
بوٹ
بارڈر
اَؤرتاں
اؤرتاں
بٹن
کَیپ
کیپ
کپڑا
کوٹ
سوتی
ڈَیمسک
ڈیمسک
ڈارِںگ
ڈارںگ
پہِراوا
پہراوا
فروک
گارب
دستانے
رُمال
رمال
ٹوپی
کوٹی
جینس
کِرٹل
کرٹل
ٹھوکر
بُناای
بناای
لیس
لِنن
لنن
مفلر
اوور
جیب
سوَیٹر
سویٹر
پجاما
رجاای
رینکوٹ
سَیںڈل
سیںڈل
سکارف
سِلاای
سلاای
سال
سیٹ
کمیج
جُتی
جتی
جُتی
جتی
سارٹس
ریسم
سکرٹ
تِلک
تلک
سموک
جُراباں
جراباں
سٹوکِںگج
سٹوکںگج
مُکدما
مکدما
سوٹِںگ
سوٹںگ
سوَیٹر
سویٹر
چیپی
دھاگا
ٹاای
تںگ
تولیا
کٹ
پگ
اںڈرپَیںٹس
اںڈرپیںٹس
کچھا
وردی
پردا
مکھملی
ویسٹ
اُن
ان
سوت
پولر
تپس
اکڑ
کھںڈی
مَیڈیٹیریان
میڈیٹیریان
ٹُںڈرا
ٹںڈرا
برفباری
برفیلا
بدلواای
چکروات
بوںداباںدی
سوکا
بھوچال
اکال
ہڑ੍ہ
دھُںد
دھںد
ٹھںڈ
گڑے
نمی
ہریکین
دھُںد
دھںد
مانسون
چِکڑ
چکڑ
بدلواای
بارس
میںہ
ریت
گڑے
دھوںاں
برف
برفباری
برف
جھکھڑ
توفان
تاپمان
گرج
بوںڈر
سُنامی
سنامی
توفان
ہنیری
کیڑی
بی
بیٹل
کَیٹرپِلر
کیٹرپلر
مچھر
تںدور
اَیلڈرفلاایج
ایلڈرفلاایج
پُراتتو
پراتتو
بارکلِس
بارکلس
بُکلاایس
بکلاایس
تِتلی
تتلی
بگ
کاکروچ
ک੍رِکٹ
ک੍رکٹ
کںنوِگس
کںنوگس
پِسو
پسو
مکھیاں
ٹِڈے
ٹڈے
لیسوِںگس
لیسوںگس
جواں
کیڑا
بِچھو
بچھو
سپفلاایج
سٹونفلاایج
دیمک
تھ੍رِپس
تھ੍رپس
دُرگھٹنا
درگھٹنا
اَیکچُری
ایکچری
ایجںٹ
اَیپلیکیسن
ایپلیکیسن
مُلاںکنکرتا
ملاںکنکرتا
دلال
اِمارت
امارت
گننا
دااوا
گاہک
کمِسن
کمسن
کںپنی
مُاوجا
ماوجا
پورا
سمجھ
نتیجا
گاہک
نُکسان
نکسان
موت
تباہی
کمایا
کمااا
کماای
کرمچاری
اگ
فرم
ہسپتال
گھر
سںملِت
سںملت
سٹ
بیما
رُجگارداتا
رجگارداتا
دینداری
نُکسان
نکسان
وپارک
پَیسا
پیسا
مہیناوار
گھبراہٹ
بھُگتان
بھگتان
نیتی
نِجی
نجی
پ੍رکِرِا
پ੍رکرا
اُتپاد
اتپاد
سںپتی
سُرکھِا
سرکھا
جنتک
جِںمیواری
جںمیواری
نتیجا
کھترا
ویچو
دُکان
دکان
سوچ
اواجاای
اواجاای
مُل
مل
واہن
ورکر
کیمت
سالانا
لیکھاکار
جواب
بونس
بورِںگ
بورںگ
اُمیدوار
امیدوار
بچے
سہِر
سہر
کںپنی
کںپِاوٹر
کںپاوٹر
سلاہ
گلبات
دیس
مںگ
وِبھاگ
وبھاگ
ڈِجااین
ڈجااین
ویروے
سںجیو
نوکری
اںگریجی
روماںچک
فَیکٹری
فیکٹری
وِت
وت
رسمی
جنرل
کِرااے
کرااے
اُدیوگ
ادیوگ
اِںٹروِاو
اںٹرواو
سامل
نوکری
چھڈو
جیوت
مَینیجر
مینیجر
مارکیٹِںگ
مارکیٹںگ
پَیسا
پیسا
اجااِب
اجااب
دفتر
ستھان
ترکی
سوال
دُہرااُن
دہراان
استیفا
جِںمیوار
جںمیوار
بھوجنالا
سیوامُکت
سیوامکت
فلدااِک
فلدااک
تنکھاہ
وِکری
وکری
وِدِالا
ودالا
وِدِارتھی
ودارتھی
ادھِاپک
ادھاپک
چیجاں
تھکاوٹ
سکھت
ٹور
بیرُجگار
بیرجگار
وَیبساایٹ
ویبساایٹ
کںم
پہاڑیاں
نہِر
نہر
اایلَیںڈ
اایلیںڈ
ک੍ریک
ماروتھل
جںگل
وَیلی
ویلی
گُفا
گفا
جھرنا
بیچ
پہاڑ
برساتی
جھاڑیاں
سہِر
سہر
ندی
تلاا
ڈَیم
ڈیم
جھیل
روڈ
جںگل
پِںڈ
پںڈ
گلی
لین
پارک
باگ
جھُگی
جھگی
گلی
اجااِب
اجااب
مَیدان
میدان
کھیت
سُرںگ
سرںگ
ب੍رِج
ب੍رج
کَینِین
کینین
سمُںدر
سمںدر
کھڑی
تٹ
اِمارت
امارت
گلیسیار
پتجھڑ
ارکٹِک
ارکٹک
دلدل
رُکھاں
رکھاں
دوسی
سلاہ
سمجھوتا
نِیُکت
نیکت
دلیل
اٹارنی
رِسوت
رسوت
سںکھیپ
کاروبار
کیس
دااوا
اِکرارناما
اکرارناما
بھ੍رِسٹاچار
بھ੍رسٹاچار
ادالت
اپرادھی
فَیسلا
فیسلا
بچاا
بچااو
سبوت
تتھ
دوسی
ہدااِت
ہداات
جج
کانوںن
وکیل
کانوںنی
وِاکتی
واکتی
بینتی
پُلِس
پلس
سرکاری
سجا
اِنکار
انکار
رِستیدار
رستیدار
کمرا
واک
بِان
بان
سمرتھن
فَیسلا
فیسلا
سونا
سِلور
سلور
تاںبا
جِںک
جںک
کولا
لوہا
سٹیل
ٹِن
ٹن
اگواای
سںگمرمر
چسما
سَیل
سیل
چاک
پارا
میکا
کورنیلِان
کورنیلان
گںدھک
اَیںٹیمنی
ایںٹیمنی
ارسَینِک
ارسینک
سرگرمی
وِوستھِت
ووستھت
ہملاورتا
وںڈ
اس
مُلاکات
ملاکات
سالسی
ادھِکار
ادھکار
سںتُلن
سںتلن
سودیباجی
فٹی
امدن
کاروبار
دااوا
سہِیوگ
سہیوگ
سںچار
کںپنی
سُلاہ
سلاہ
سہِیوگ
سہیوگ
لاگت
نِردیسک
نردیسک
کُسلتا
کسلتا
اُدم
ادم
کارجکاری
وِت
وت
اُدیوگ
ادیوگ
جانکاری
مُدے
مدے
نیتا
لیڈرسِپ
لیڈرسپ
گُااُنا
گاانا
پ੍ربںدھن
مَینیجر
مینیجر
وِچولگی
وچولگی
سلاہکار
انُکول
انکول
سںستھا
یوجنابںدی
پ੍رکِرِا
پ੍رکرا
اُتپاد
اتپاد
اُتپادن
اتپادن
پ੍روجَیکٹ
پ੍روجیکٹ
جِںمیواری
جںمیواری
سیوا
ہُنر
ہنر
سُپرواایجر
سپرواایجر
سِکھِارتھی
سکھارتھی
جِت
جت
سبد
اکار
سدی
دِن
دن
دہاکا
گھنتا
گھںٹا
اِںچ
اںچ
لںباای
لِٹر
لٹر
پُںج
پںج
ماپ
میٹر
میل
مِںٹ
مںٹ
مہینا
یونِٹ
یونٹ
بھار
سال
گَیرہاجر
گیرہاجر
پورا
پتا
سمجھوتا
الاٹ
گھوسنا
مافی
سوںپنا
سُرو
سرو
امدن
کاروبار
ہالات
سپسٹیکرن
سہِیوگ
سہیوگ
ٹِپنی
ٹپنی
سِکااِت
سکاات
فَیسلا
فیسلا
وِاکھِا
واکھا
کھتم
بھُل
بھل
رسمیتا
اگے
بھوِکھ
بھوکھ
سِکااِت
سکاات
وِچار
وچار
لاگو
لاجمی
میٹِںگ
میٹںگ
مَیںبر
میںبر
رااے
سںستھا
موجود
نِجی
نجی
دی
بولو
رننیتی
سفل
سُجھاا
سجھاا
سُپرواایجر
سپرواایجر
اج
تسدیک
جنوری
فروری
مارچ
اپ੍رَیل
اپ੍ریل
مای
جون
جُلاای
جلاای
اگست
ستںبر
اکتوبر
نوںبر
دسںبر
سںدھِا
سںدھا
یُگ
یگ
مہینا
سدیوتا
بھوِکھ
بھوکھ
جیون
پل
گتی
لیکھ
کِتاباں
کتاباں
کاروبار
سَیںسر
سیںسر
چَیک
چیک
پترکار
الوچک
وِبھاگ
وبھاگ
ڈَیسک
ڈیسک
سںپادِت
سںپادت
سںپادک
کھاس
روماںچک
وِسیس
وسیس
انُبھوی
انبھوی
ماہر
مسہور
وِسیستا
وسیستا
گلپ
فِلماں
فلماں
بھوجن
وِدیسی
ودیسی
مہتوپورن
امدن
پترکار
مَیگجین
میگجین
سمگری
میڈیا
سودھو
پَیسا
پیسا
کھبراں
اکھبار
پ੍راپت
اپمانجنک
رااے
کاگج
کھاس
اِجاجت
اجاجت
وِاکتی
واکتی
راجنیتی
پوسٹ
پ੍رکاسن
پ੍رکاسِت
پ੍رکاست
یوگتا
گُنوتا
گنوتا
بھروسییوگ
رِپورٹ
رپورٹ
سنسنی
ہَیران
ہیران
وِسیس
وسیس
کھیڈاں
کہانی
وِسا
وسا
ٹَیکسٹ
ٹیکسٹ
وِسا
وسا
یاترا
وَیبساایٹ
ویبساایٹ
لِکھنا
لکھنا
سِفر
سفر
اِک
اک
دو
تِن
تن
چار
پںج
چھے
ست
اٹھ
نوں
دس
گِاراں
گاراں
باراں
تیراں
چوداں
پںدراں
سولاں
ستاراں
اٹھاراں
اُنی
انی
ویہ
اِکی
اکی
باای
تیای
چووی
پچی
چھبی
ستاای
اٹھاای
اُنتی
انتی
تیہ
اِکتی
اکتی
بتی
تیتی
چوںتی
پَیںتی
پیںتی
چھتی
سَیںتی
سیںتی
اٹھتی
اُنتالی
انتالی
چالی
اِکتالی
اکتالی
بتالی
ترتالی
چوتالی
پںجتالی
چھِالی
چھالی
سںتالی
اٹھتالی
اُنِںجا
انںجا
پںجاہ
اِکوںجا
اکوںجا
بوںجا
تروںجا
چروںجا
پچوںجا
چھپںجا
ستوںجا
اٹھوںجا
اُناہٹھ
اناہٹھ
سٹھ
اِکاہٹھ
اکاہٹھ
باہٹھ
تریںہٹھ
چوںہٹھ
پَیںہٹھ
پیںہٹھ
چھِاہٹھ
چھاہٹھ
ستاہٹھ
اٹھاہٹھ
اُنتر
انتر
ستر
اِکہتر
اکہتر
بہتر
تہیتر
چہتر
پچتر
چھِاتر
چھاتر
ستتر
اٹھتر
اُناسی
اناسی
اسی
اِکاسی
اکاسی
بِاسی
باسی
تِراسی
تراسی
چوراسی
پچاسی
چھِاسی
چھاسی
ستاسی
اٹھاسی
اُننویں
اننویں
نبے
اِکنوے
اکنوے
بنوے
ترنوے
چرنوے
پچنوے
چھِانوے
چھانوے
ستنوے
اٹھنوے
نڑِنوے
نڑنوے
سو
چوڑی
بَیلٹ
بیلٹ
کںگن
رتن
چین
کلِپ
کلپ
کورل
تاج
ہیرا
پںنے
رتن
سونا
Pin
گہِنے
گہنے
مَیڈل
میڈل
ہار
اوپل
موتی
کُارٹج
کارٹج
رِںگ
رںگ
رتن
نیلم
سِلور
سلور
پُکھراج
پکھراج
فِروجاای
فروجاای
رِسٹلَیٹ
رسٹلیٹ
گارنیٹ
اونِکس
اونکس
سہِر
سہر
سہِر
سہر
پِںڈ
پںڈ
گلی
ہال
لین
پارک
باگ
اجااِب
اجااب
گلی
لںگر
اِکویریام
اکویریام
اَیوینِ.
ایوین.
جھُگی
جھگی
سڑک
کتار
اُپنگر
اپنگر
وارڈ
بورو
بُلیوارڈ
بلیوارڈ
کاجویا
court
چںدرما
سمسانگھاٹ
دانے
کبرِستان
کبرستان
جِمکھانا
جمکھانا
ہَیملیٹ
ہیملیٹ
ہربیریام
نرک
پَیرِس
پیرس
پ੍رومنیڈ
بُدھ
بدھ
سُکر
سکر
دھرتی
مںگل
ب੍رہِسپتی
ب੍رہسپتی
سنی
ارُن
ارن
ورُن
ورن
بدل
گلَیکسی
گلیکسی
گلوب
گںبھیرتا
چںد
گھیرے
گ੍رہِ
گ੍رہ
سَیٹیلاایٹ
سیٹیلاایٹ
تارے
سورج
ب੍رہِمںڈ
ب੍رہمںڈ
سںسار
اَیکورن
ایکورن
کھیتی
اَینجیاوسپرم
اینجیاوسپرم
اٹوٹ੍روف
دو
بلیڈ
کھِڑ
کھڑ
بوٹنی
برَیکٹ
بریکٹ
ساکھا
مُکُل
مکل
کَیکٹس
کیکٹس
کَیلیکس
کیلیکس
چھتری
کارپل
کلوور
درکھت
اَیںڈوسپرم
ایںڈوسپرم
اَیپیکوٹل
ایپیکوٹل
سدابہار
فرن
کھاد
تںد
بنسپتی
فُل
فل
باگ
اُگ
اگ
جِںکگو
جںکگو
اناج
گھاہ
گروو
ودھن
گںم
کٹھور
جلدباجی
باگبانی
ہاایب੍رِڈ
ہاایب੍رڈ
فُل
فل
اِںٹرنوڈ
اںٹرنوڈ
اایوی
جںگل
جونیار
کُڈجو
کڈجو
پتا
پگ
مِڈریب
مڈریب
ایکا
کاای
اںم੍رِت
اںم੍رت
سوای
نوڈ
گِری
گری
اںڈاسی
ہتھیلی
پَیلمیٹ
پیلمیٹ
پیڈنکل
سدیوی
پتل
فلواِم
فلوام
پ੍رکاس
پِستِل
پستل
بور
پراگِت
پراگت
بُنو
بنو
تِاگ
تاگ
رَیجِن
ریجن
جال
رِںگ
رںگ
روٹ
سس
پودا
بیج
بیج
سیپل
سَیمروک
سیمروک
سوٹ
جھاڑی
مِٹی
مٹی
ریڑ੍ہ
بیج
فُٹنا
فٹنا
ڈںڈی
پِںڈا
پںڈا
کھڑے
سٹَیم
سٹیم
کلںک
نِیم
نیم
سٹوما
رُکھا
رکھا
دھُپ
دھپ
کںڈا
رُکھ
رکھ
تنے
کںد
ٹُبھی
ٹبھی
گھٹ
ناڑی
ہواداری
ویل
بوٹی
گھُںمِا
گھںما
نِرںکُستا
نرںکستا
کارکُن
کارکن
سلاہکار
وکالت
اںدولن
کھیتیباڑی
سمجھوتا
دوستی
اسَیںبلی
اسیںبلی
ادھِکار
ادھکار
جاگروکتا
سبھِاتا
سبھاتا
ورگواد
گٹھجوڑ
سہِواس
سہواس
مِلیبھُگت
ملیبھگت
بستیوادی
کمیٹی
کمِاونِجم
کماونجم
سںگھ
کانفرںس
سںگھرس
سںوِدھان
سںودھان
سںمیلن
بھ੍رِسٹاچار
بھ੍رسٹاچار
کوںسل
دیس
دیس
ادالت
سںکٹ
سبھِاچار
سبھاچار
بہِس
بہس
وفد
لوکتںتر
پ੍ردرسن
ناپسںد
تااِنات
تاانات
تاناساہ
کوٹنیتی
اسہِمتی
اسہمتی
دان
ڈِاوٹی
ڈاوٹی
راجوںس
ارتھِکتا
ارتھکتا
چون
چونویں
کُلین
کلین
پابںدی
دوتاواس
پ੍رتیک
پرواسی
سامراج
داکھلا
واتاورن
سمانتا
بچنا
کارجکاری
کھرچ
دھڑا
فَیڈریسن
فیڈریسن
فںڈ
سرکار
اُدگھاٹن
ادگھاٹن
امدن
مہِںگاای
مہںگاای
سںستھا
نیتا
ادھِکار
ادھکار
اُدار
ادار
لِںپٹ
لںپٹ
لابیِسٹ
لابیسٹ
ہُکم
ہکم
مَیںبر
میںبر
اپسی
کھبراں
پ੍رنام
اِتراج
اتراج
کُلینتا
کلینتا
وِرودھ
ورودھ
سمجھوتا
سںسد
دیس
نیتی
راجنیتی
ابادی
پ੍ردھانگی
جیل੍ہ
پ੍رولیتاری
جاری
سمرتھک
بھڑکااُنا
بھڑکاانا
نسلواد
ریکَیںٹ
ریکیںٹ
مُڑ
مڑ
اسویکار
سُدھار
سدھار
رِستا
رستا
گنتںتر
مںگ
رااِلٹی
راالٹی
منجوری
سماج
کنوںن
سفلتا
ٹَیکس
ٹیکس
سِدھاںت
سدھاںت
مُل
مل
ووٹِںگ
ووٹںگ
جںگ
بھلاای
چلااُنا
چلاانا
سویکار
وِوستھِت
ووستھت
ایجںٹ
دی
مُلاںکن
ملاںکن
سںپتی
بھروسا
اُدھار
ادھار
کھریددار
ساودھان
نکد
لگن
سُپنا
سپنا
جتن
فیس
فںڈ
گھر
بیما
دِلچسپی
دلچسپی
رِنداتا
رنداتا
کرجا
باجار
مہیناوار
مورگیج
لوڑ
بھُگتان
بھگتان
لوک
پ੍رتیست
نِرںتر
نرںتر
سںبھاوی
پِچھلا
پچھلا
نِجی
نجی
لابھ
کھریدو
در
اسویکار
رِجرو
رجرو
بچااو
ویچن
کارجکال
سال
پِتا
پتا
ماں
بھرا
بھَین
بھین
پُتر
پتر
دھی
بھتیجے
بھتیجی
ماسی
چاچا
اِک
اک
پتی
پتنی
پتی
بھوِکھ
بھوکھ
بھوِکھ
بھوکھ
پوتا
دادا
دادی
سس
جیجا
جواای
نوںہ
دوستو
پ੍ریمی
سبںدھ
رِستیدار
رستیدار
مہِمان
مہمان
مالکن
ماپے
بچا
پیڑ੍ہی
پرِوار
پروار
لوک
وِبھچاری
وبھچاری
دوت
مسہ
مُافی
مافی
دھرم-تِاگ
دھرم-تاگ
پ੍راسچِت
پ੍راسچت
بپتِسما
بپتسما
بیسِلِکا
بیسلکا
بیٹیفِکیسن
بیٹیفکیسن
وِسواس
وسواس
کَینونیکل
کینونیکل
رسمی
چَیپل
چیپل
پوِترتا
پوترتا
ایساای
چرچ
کلیسٹر
سںمیلن
اِکبال
اکبال
انُکول
انکول
مںڈلی
پوِتر
پوتر
پچھتاوا
سلیب
پںتھ
نِںدِا
نںدا
دھوکھیباج
دیوتا
بھوت
سَیتان
سیتان
مانیوگ
ب੍رہم
اَیپیفنی
ایپیفنی
وِاکھِا
واکھا
مُاوجا
ماوجا
وِسواس
وسواس
وِسواسہین
وسواسہین
فَیٹِس
فیٹس
سوکین
وِبھچار
وبھچار
تپسِا
تپسا
اُتپتی
اتپتی
رب
پوِتر
پوتر
کوم
سورگ
نرک
دھروہ
اسرم
ہِںدی
ہںدی
پوِترتا
پوترتا
پوِتر
پوتر
بھجن
مورتی
اِمولیسن
امولیسن
اہُدیدار
اہدیدار
بیوفاای
پُچھگِچھ
پچھگچھ
روکو
ٹون
سدا
بدنام
کانوںنی
ادھِکار
ادھکار
پوجا
مریادا
پ੍ربھو
مہِما
مہما
دوسی
ہَیرانی
ہیرانی
چمتکار
مٹھواسی
دُکھی
دکھی
مسجِد
مسجد
سوگ
دُنِاوی
دناوی
مُسلمان
مسلمان
ایساای
اںم੍رِت
اںم੍رت
نِروان
نروان
اوِسواسی
اوسواسی
ننری
سہُں
سہں
اگِاکاری
اگاکاری
ادھِکاری
ادھکاری
سگن
سرو
موکھِک
موکھک
بھاسن
تالمیل
کٹڑپںتھی
مںدر
پوپ
رومن
پَیرِس
پیرس
کُلپتی
کلپتی
پُرکھی
پرکھی
تپسِا
تپسا
تیرتھ
پوپ
دلان
پ੍رارتھنا
پ੍رچار
پ੍رچارک
پُجاری
پجاری
پ੍ریمیٹ
پ੍رااِری
پ੍رااری
اپوِتر
اپوتر
بھوِکھبانی
بھوکھبانی
دھرم
پ੍روویڈَیںس
پ੍روویڈیںس
مانسِکتا
مانسکتا
پلپِٹ
پلپٹ
رولا
پُنر
پنر
اِکاںت
اکاںت
رَیکٹری
ریکٹری
رِفَیکٹری
رفیکٹری
اوسیس
دھرم
دھارمِکتا
دھارمکتا
وستو
مُافی
مافی
توبا
مںگ
پُنر-اُتھان
پنر-اتھان
مُڑ
مڑ
ستِکاریوگ
ستکاریوگ
پُنرجیونوادی
پنرجیونوادی
رسم
مالا
کُربانی
کربانی
دھرم
سَیمیناریان
سیمیناریان
اُپدیس
اپدیس
اُپدیس
اپدیس
کفن
پاپ
اتما
بینتی
ایساای
بِسپاں
بسپاں
تںبو
سمجھے
ٹوںسر
اُلںگھنا
الںگھنا
مُسکل
مسکل
اُلںگھنا
الںگھنا
بِپتا
بپتا
ت੍رِایک
ت੍رایک
بھروسا
ادھرمی
اپوِتر
اپوتر
گَیر-پرںپراگت
گیر-پرںپراگت
اچھوت
پوجا
پوجا
سچمُچ
سچمچ
کسم
اُپاسک
اپاسک
جوسیلے
کٹورا
کںٹین
مُرگے
مرگے
کھانا
پکوان
گاہک
مِٹھاای
مٹھاای
کھُراک
کھراک
رات
پکوان
پکوان
سُکِا
سکا
ڈرِںکس
ڈرںکس
کھااو
کھانا
مہِںگا
مہںگا
پرِوار
پروار
بھوجن
دوست
سِہت
سہت
گھر
دُپہِر
دپہر
بھوجن
میٹ
گِریدار
گریدار
لوک
پولٹری
بھوجنالا
سُادی
سادی
سیوا
سدما
وِسیس
وسیس
مسالیدار
ادھِاَین
ادھاین
مِٹھا
مٹھا
میج
یاترا
ساکاہاری
بہِرا
بہرا
کںم
کلم
پَینسِل
پینسل
کِتاب
کتاب
کاگج
مِٹااُن
مٹاان
بلَیک
بلیک
کُرسی
کرسی
بوتل
بَیگ
بیگ
کاپی
کَیچی
کیچی
گوںد
سِاہی
ساہی
پِںن
پںن
کںپِ
کںپ
کَیلکُلیٹر
کیلکلیٹر
ربڑ
پیںٹ
پَیلیٹ
پیلیٹ
کلِپ
کلپ
سٹَیپلر
سٹیپلر
کںپاس
پ੍روٹَیکٹر
پ੍روٹیکٹر
ہاکم
بیکر
فلاس
نکسا
گھڑی
گلوب
اکَیڈمی
اکیڈمی
کلاس
کوچ
کالج
ڈَیسک
ڈیسک
سِکھِات
سکھات
فیس
فارم
اواس
سِکھو
سکھو
لَیکچرار
لیکچرار
پاٹھ
ستِگُرو
ستگرو
وِدِالا
ودالا
سٹاف
وِدِارتھی
ودارتھی
ادھِاپک
ادھاپک
بسںت
گرمی
پتجھڑ
سردیاں
بیچ
پںچھی
کَیںپِںگ
کیںپںگ
بدل
پیاو
فُل
فل
باگبانی
دستانے
واڈھی
کوٹی
ال੍ہنے
میںہ
رَیک
ریک
سکارف
سکیاِںگ
سکیاںگ
برف
دھُپ
دھپ
سنسک੍رین
یاترا
چھتری
چھُٹی
چھٹی
ہوا
چکر
ورگ
تِکون
تکون
ااِتکار
ااتکار
سِلںڈر
سلںڈر
کون
گھن
گولا
بَیںچ
بیںچ
کارڈ
درکھت
وِرودھی
ورودھی
ک੍رییون
سبدکوس
وِبھاجن
وبھاجن
لِفافا
لفافا
مِٹااُن
مٹاان
فاایل
گوںد
گںم
دھارک
سِاہی
ساہی
سِاہی
ساہی
پُستک
پستک
نکسا
اکھبار
نیب
کاگج
پَینسِل
پینسل
کلم
پِںن
پںن
پںچ
رجِسٹر
رجسٹر
Stamp
ہاکم
موہر
ٹٹی
ٹیبل
ٹَیگ
ٹیگ
چیپی
تار
اںگریجی
گنِت
گنت
جیو
بنسپتی
جیو
بھوتِک
بھوتک
رسااِن
رساان
وِگِان
وگان
اِتِہاس
اتہاس
بھوگول
سِوِکس
سوکس
اِلَیکٹ੍رونِکس
الیکٹ੍رونکس
ونج
لیکھاکاری
ارتھ
نرسِںگ
نرسںگ
اںکڑے
پوسن
سِدھ
سدھ
سکِںٹ
سکںٹ
مِںٹ
مںٹ
گھںٹا
دِن
دن
ہفتا
مہینا
سال
سویر
دُپہِر
دپہر
سام
رات
پہِلاں
پہلاں
دے
کُارٹر
کارٹر
سالانا
دسک
سدی
ہجار
گھڑی
دیری
نِت
نت
اج
کل੍ہ
دیر
کِسے
کسے
سپَین
سپین
اُمر
امر
لہِر
لہر
مَیریڈیان
میریڈیان
پل
بااد
بااد
ایجںٹ
ساایکل
ساایکل
کِستی
کستی
سڑک
ڈیرے
چار
کروج
مںجِل
مںجل
سَیر
سیر
کِستی
کستی
ف੍ریویا
ہاایوے
ہوٹل
یاترا
لین
سمان
موٹرساایکل
سمُںدر
سمںدر
یاتری
پورٹ
ریل
سڑک
رستا
جہاج
سمُںدر
سمںدر
جہاج
سبویا
سوٹکیس
ٹَیکسی
ٹیکسی
دورا
سَیر
سیر
اواجاای
ٹ੍رین
یاترا
یاترا
چھُٹی
چھٹی
یاترا
ببول
ارکَینٹ
ارکینٹ
باںس
بنیان
سک
بِرچ
برچ
بڈ
کَیکٹس
کیکٹس
گںنا
سیڈر
ناریال
کواِر
کوار
کونِفر
کونفر
ک੍ریپر
ایبونی
فاایبر
فلَیکس
فلیکس
فُل
فل
کیٹانو
کرودا
بھ੍رِسٹاچار
بھ੍رسٹاچار
امرود
گم
جَیک
جیک
جوس
جوٹ
پتا
ام
ملبیری
نِںم
نںم
اوک
جَیتون
جیتون
پام
پااین
پراگ
پولیلتھیا
پلَینٹن
پلینٹن
مِجھ
مجھ
روٹ
چںدن
بیج
سیسم
چمڑی
سٹَیم
سٹیم
پتھر
اِملی
املی
ٹیک
کںڈا
لکڑ
تاپمان
ہوا
نمی
ورکھا
بدلواای
برفباری
برفیلا
ہوا
تاپمان
ٹھںڈا
ساف
بدل
ٹھںڈا
چکروات
ڈِگری
ڈگری
بوںدا-باںدی
سوکا
فارنہیٹ
ہڑ੍ہ
دھُںد
دھںد
پورو
ٹھںڈ
ٹھںڈک
گڑے
ہریکین
برفیلا
بِجلی
بجلی
موسم
ہلکے
بدلواای
چھپڑ
میںہ
سترںگی
میںہ
سیجن
ساور
دھوںاں
برف
برف
جھُلسن
جھلسن
دھُپ
دھپ
سنسک੍رین
دھُپے
دھپے
تھرمامیٹر
گرج
بَیںگن
بیںگن
پتا
گاجر
گوبھی
کھیرا
لسن
ادرک
پِاج
پاج
الو
ٹماٹر
کدو
مولی
پالک
امرانتھ
فلیاں
چُکںدر
چکںدر
سِملا
سملا
اجوااِن
اجواان
مِرچ
مرچ
دھنیا
مکای
کااُپیا
کااپیا
گھیا
کالے
نِںبو
نںبو
سلاد
لفا
کھُںب
کھںب
مٹر
پُدینا
پدینا
پودا
ٹَیپیاوکا
ٹیپیاوکا
پُدینا
پدینا
ہلدی
سلگم
جِوِکںد
جوکںد
میکھ
ب੍رِسبھ
ب੍رسبھ
مِتھُن
متھن
کرک
سِںگھ
سںگھ
کںنِا
کںنا
تُلا
تلا
ب੍رِسچک
ب੍رسچک
دھنوں
مکر
کُںبھ
کںبھ
مین
الٹیر
پُراتن
پراتن
جوتِس
جوتس
بھوِکھبانی
بھوکھبانی
راجوںس
سورگ
کُںڈلی
کںڈلی
جادو
اِنکلاب
انکلاب
ادھِاتمِک
ادھاتمک
اُترادھِکار
اترادھکار
راسی
اپ੍رون
ٹوکری
بیٹر
بلَیڈر
بلیڈر
اُبالن
ابالن
بوتل
کٹورا
ب੍رااِلر
ب੍راالر
جھاڑو
کَیبنِٹ
کیبنٹ
کَیڈی
کیڈی
کَیرافے
کیرافے
کساای
وہر
ساف
پکااُ
پکاا
رسوای
کوکر
وِرودھی
ورودھی
پِالا
پالا
بھوجن
کٹورے
اٹے
بھوجن
کاںٹا
فریجر
فراایر
گلاس
گراایڈ
گرِل
گرل
چکی
سیسی
جگ
جوسر
کیتلی
رسوای
چاکو
لاڈلا
ڈھکن
بھِجِا
بھجا
مالک
مِکسر
مکسر
اَیماوپی
ایماوپی
مگ
رُمال
رمال
اوپنر
اوون
پَین
پین
پیلر
کیڑا
گھڑا
پلیٹ
گھڑا
سیما
دُبارا
دبارا
وِاںجن
واںجن
فرِج
فرج
روسٹر
چٹنی
کاست
الماریاں
سِایوی
سایوی
چھاننی
ڈُبنا
ڈبنا
لکڑ
لںبے
ٹُکڑا
ٹکڑا
سابن
چوڑی
مسالے
سپںج
چمچا
سٹیمر
چُل੍ہا
چل੍ہا
ٹیبل
ٹیبلکلاتھ
ٹیپوٹ
تھرمامیٹر
ٹاایمر
ٹِن
ٹن
ٹوسٹ
چِمٹا
چمٹا
ٹرے
ت੍رِپت
ت੍رپت
گڑبڑ
اِک
اک
برتن
پانی
کورڑا
جھٹکا
نیلا
ب੍رااین
پی
ٹاپو
کمی
ساگر
چھپڑ
روک
لون
ریت
ساگر
سمُںدری
سمںدری
جہاج
جوار
یاترا
پانی
کیٹ
وایومںڈل
بِماری
بماری
پودِاں
پوداں
گھاہ
اَیلگی
ایلگی
اَیلرجی
ایلرجی
مرداں
انستھیسیا
دوتاں
منُکھاں
منکھاں
مدھو
مکڑیاں
مںگل
ک੍ریفِس
ک੍ریفس
جیون
سُنواای
سنواای
واتاورن
منُکھی
منکھی
بَیکٹیریا
بیکٹیریا
سٹالراں
کِتاباں
کتاباں
جیون
وایومںڈل
دِل
دل
چرِتر
چرتر
سَیتان
سیتان
سمیں
جلوایو
بیٹلس
وایومںڈل
گولے
کاسمَیٹِکس
کاسمیٹکس
کھوپڑی
اپرادھ
کُتِاں
کتاں
سَیلاں
سیلاں
سَیلاں
سیلاں
بھوتاں
رُکھاں
رکھاں
رُکھاں
رکھاں
لِگامَیںٹس
لگامیںٹس
اُپبھاساواں
اپبھاساواں
مکھیاں
مرداں
چرچ
پ੍راچین
بھروناں
بُجھارتاں
بجھارتاں
وااین
کیڑِاں
کیڑاں
اَینجاایماں
اینجاایماں
بِماریاں
بماریاں
گِان
گان
نسل
سںگیت
جانوراں
بِلیاں
بلیاں
گربھستھ
کیڑیاں
بِجلی
بجلی
بھوِکھ
بھوکھ
ردی
دھرتی
گلیسیاراں
لِکھن
لکھن
کھون
سورج
سورج
جِگر
جگر
سپاں
بگس
پوِتر
پوتر
گھوڑِاں
گھوڑاں
جیوت
بھومیگت
پانی
نیںد
مچھی
اِمِن
امن
اِسلام
اسلام
جپانی
ترںگاں
تِتلیاں
تتلیاں
چٹاناں
کھیڈاں
تھندھاری
موسم
ماپ
سوکھم
کھنِجاں
کھنجاں
وِںڈ
وںڈ
اجااِب
اجااب
سںگیت
فںجاای
ماسپیسیاں
کیڑیاں
مِتھِہاس
متھہاس
رگڑ
بدلاں
گُردے
گردے
ناڑیاں
روگ
سںکھِاواں
سںکھاواں
پوسن
سمُںدراں
سمںدراں
وااین
ہر
کَیںسر
کیںسر
سُپنِاں
سپناں
ہوںد
اںڈے
اکھاں
سںگیت
پںچھیاں
پہاڑاں
ٹِڈیاں
ٹڈیاں
ہڈیاں
کںن
کںن
کںن
پورو
بور
پرجیویاں
بِماری
بماری
بچِاں
بچاں
چٹاناں
نسِاں
نساں
ووکل
اَیلگی
ایلگی
پودِاں
پوداں
ودھ
دواای
پ੍راایمَیٹس
پ੍راایمیٹس
کِرناں
کرناں
پ੍رواہ
نک
مل
بھوچالاں
چںدرما
سںکیتاں
سپاں
سَیکس
سیکس
کھُراک
کھراک
سماج
نیںد
منُکھی
منکھی
موںہ
سُمیریان
سمیریان
لچھناں
گرمی
دھرم
تِبت
تبت
جنیپے
جہِراں
جہراں
رگڑ
والاں
ورگیکرن
ٹیکے
وَیریال
ویریال
جھںڈے
اپرادھ
وااِرساں
واارساں
لکڑ
جانوراں
پسواں
فرمَیںٹیسن
فرمیںٹیسن
لیکھاکار
ابھِنیتا
ابھنیتا
ابھِنیتری
ابھنیتری
وکیل
ایجںٹ
ارکیٹَیکٹ
ارکیٹیکٹ
کلاکار
نِلامی
نلامی
لیکھک
بیکر
ناای
لُہار
لہار
کِستی
کستی
چھاتیاں
دلال
کساای
بٹلر
ترکھان
کَیریار
کیریار
کَیسیار
کیسیار
چوفار
کَیمِسٹ
کیمسٹ
کلینر
کلرک
کوچمَین
کوچمین
موچی
کُلَیکٹر
کلیکٹر
کںپوسِٹر
کںپوسٹر
مِسرِت
مسرت
کںڈکٹر
مِلاپ
ملاپ
کاںسٹیبل
ٹھیکیدار
پکااُ
پکاا
کولِ
کول
کاریگر
ڈاںسر
دںداں
ڈِجااِنر
ڈجاانر
ڈاکٹر
ڈرافٹمَین
ڈرافٹمین
ناٹککار
ڈراپر
ڈرگجِسٹ
ڈرگجسٹ
ڈااِر
ڈاار
سںپادک
اِلَیکٹ੍ریسیان
الیکٹ੍ریسیان
اِںجینیار
اںجینیار
پ੍ریکھِاک
پ੍ریکھاک
کِسان
کسان
فااِرمَین
فاارمین
مچھیرے
فُلدار
فلدار
مالی
گلیجیار
سُنہِری
سنہری
ہیار
ہاکر
اِںسپَیکٹر
اںسپیکٹر
جوہری
پترکار
جج
مجدور
مکان
وکیل
لَیکچرار
لیکچرار
لااِب੍ریریان
لااب੍ریریان
لاایفگارڈ
جادوگر
مَینیجر
مینیجر
مسن
مکَینِک
مکینک
وپاری
مَیسیںجر
میسیںجر
داای
دُدھ
ددھ
دُدھ
ددھ
مںتری
ماڈل
سںگیتکار
ناولکار
نرس
تیلمَین
تیلمین
چالک
اپٹیسیان
پیںٹر
چپڑاسی
اتر
فارماسِسٹ
فارماسسٹ
فوٹوگ੍رافر
وَید
وید
پااِلٹ
پاالٹ
پلںبر
کوی
پُلِس
پلس
سِاستدان
ساستدان
پوسٹمَین
پوسٹمین
گھُمِار
گھمار
پُجاری
پجاری
پ੍رِںٹر
پ੍رںٹر
مالک
پ੍رکاسک
رِسَیپسنِسٹ
رسیپسنسٹ
پ੍رچون
ملاہ
وِگِانی
وگانی
مورتیکار
سَیکٹری
سیکٹری
بیجوان
جُتی
جتی
دُکاندار
دکاندار
سِپاہی
سپاہی
سرجن
سویپر
درجی
ادھِاپک
ادھاپک
انُوادک
انوادک
کھجانچی
ٹرنر
ٹیکاکرتا
بہِرا
بہرا
ویٹرَیس
ویٹریس
دھون
دھوتی
چوکیدار
جُلاہے
جلاہے
کامے
لیکھک